In [3]:
import numpy as np
import pandas as pd

# Vectorized Operation

In [14]:
%%time

print("Time taken by vectorized sum : ", np.sum(np.arange(15000)))
print()

Time taken by vectorized sum :  112492500

CPU times: user 165 µs, sys: 35 µs, total: 200 µs
Wall time: 196 µs

In [13]:
%%time

# iterative sum
total = 0

for item in range(0, 15000):
    total += item
    
a = total
 
print("Time taken by iterative sum : ", a)
print()

Time taken by iterative sum :  112492500

CPU times: user 3.04 ms, sys: 127 µs, total: 3.17 ms
Wall time: 3.15 ms

## Use case

- 누적합 구하기 => n+1 = n + 이전합

In [21]:
values = pd.Series([number for number in range(1, 10000)])

values

0          1
1          2
2          3
3          4
4          5
        ...
9994    9995
9995    9996
9996    9997
9997    9998
9998    9999
Length: 9999, dtype: int64

In [38]:
# iterative way

cumulative_values = []

for v in values:
    if v == 1:
        cumulative_values.append(v)
        continue
    cumulative_values.append(v + cumulative_values[-1])
    
pd.Series(cumulative_values)

0              1
1              3
2              6
3             10
4             15
          ...
9994    49955010
9995    49965006
9996    49975003
9997    49985001
9998    49995000
Length: 9999, dtype: int64

In [40]:
# vertorized way

values.cumsum()

0              1
1              3
2              6
3             10
4             15
          ...
9994    49955010
9995    49965006
9996    49975003
9997    49985001
9998    49995000
Length: 9999, dtype: int64

- 요일이름 구하기

In [48]:
dates = pd.Series(pd.date_range("2022-01-01", "2022-12-31"))

dates

0     2022-01-01
1     2022-01-02
2     2022-01-03
3     2022-01-04
4     2022-01-05
         ...
360   2022-12-27
361   2022-12-28
362   2022-12-29
363   2022-12-30
364   2022-12-31
Length: 365, dtype: datetime64[ns]

In [62]:
from datetime import datetime

day = datetime(2022, 1, 1)
print(day)

print(day.strftime("%A"))

2022-01-01 00:00:00
Saturday

In [69]:
# iterative way

day_names = []

for date in dates:
    day_names.append(date.strftime("%A"))
    
pd.Series(day_names)

0       Saturday
1         Sunday
2         Monday
3        Tuesday
4      Wednesday
         ...
360      Tuesday
361    Wednesday
362     Thursday
363       Friday
364     Saturday
Length: 365, dtype: object

In [70]:
dates.dt.day_name()

0       Saturday
1         Sunday
2         Monday
3        Tuesday
4      Wednesday
         ...
360      Tuesday
361    Wednesday
362     Thursday
363       Friday
364     Saturday
Length: 365, dtype: object

# index

In [73]:
data = {
    "customer_id": [1, 2, 3],
    "name": ["kim", "lee", "park"],
    "age": [35, 41, 25]
}

df = pd.DataFrame(data)

df

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            3  park   25

In [74]:
df.loc[1]

customer_id      2
name           lee
age             41
Name: 1, dtype: object

In [76]:
df.iloc[1]

customer_id      2
name           lee
age             41
Name: 1, dtype: object

`loc` 과 `iloc` 의 차이?

In [92]:
name_df = df.set_index("name")

name_df

      customer_id  age
name
kim             1   35
lee             2   41
park            3   25

In [94]:
# KeyError

name_df.loc[1]

In [95]:
name_df.iloc[1]

customer_id     2
age            41
Name: lee, dtype: int64

In [96]:
name_df.loc["kim"]

customer_id     1
age            35
Name: kim, dtype: int64

## MultiIndex

In [100]:
multi_index_df = df.set_index(["customer_id", "name"])

multi_index_df

                  age
customer_id name
1           kim    35
2           lee    41
3           park   25

In [105]:
multi_index_df.loc[(1, "kim")]

age    35
Name: (1, kim), dtype: int64

### Use multi index

In [113]:
data = {
    "customer_id": [1, 2, 5, 7, 3],
    "name": ["kim", "lee", "kim", "lee", "park"],
    "age": [35, 41, 12, 46, 25]
}


df_with_same_name = pd.DataFrame(data)

df_with_same_name

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            5   kim   12
3            7   lee   46
4            3  park   25

In [117]:
multi_index_with_same_name = df_with_same_name.set_index(["name", "customer_id"])

multi_index_with_same_name

                  age
name customer_id
kim  1             35
lee  2             41
kim  5             12
lee  7             46
park 3             25

In [118]:
multi_index_with_same_name.loc["kim"]

             age
customer_id
1             35
5             12

In [119]:
multi_index_with_same_name.sort_index()

                  age
name customer_id
kim  1             35
     5             12
lee  2             41
     7             46
park 3             25

In [120]:
multi_index_with_same_name.loc[("lee", 7)]

age    46
Name: (lee, 7), dtype: int64

## `set_index`, `reset_index`

In [122]:
df.set_index("customer_id")

             name  age
customer_id
1             kim   35
2             lee   41
3            park   25

In [138]:
# note: you should assign `set_index` result to original variable
df = df.set_index(["customer_id", "name"])

df

                  index  age
customer_id name
1           kim       0   35
2           lee       1   41
3           park      2   25

In [139]:
# note: you should assign `reset_index` result to original variable
df = df.reset_index()

df

   customer_id  name  index  age
0            1   kim      0   35
1            2   lee      1   41
2            3  park      2   25

## Time index

In [146]:
from random import randint

dates = pd.date_range("2022-01-01", "2023-12-31")

df = pd.DataFrame({
    "date": dates,
    "values": [randint(1, 100) for _ in range(len(dates))],
})

df

          date  values
0   2022-01-01      98
1   2022-01-02      98
2   2022-01-03      18
3   2022-01-04      30
4   2022-01-05      93
..         ...     ...
725 2023-12-27      74
726 2023-12-28       6
727 2023-12-29      66
728 2023-12-30      54
729 2023-12-31      78

[730 rows x 2 columns]

In [147]:
df = df.set_index("date")

df

            values
date
2022-01-01      98
2022-01-02      98
2022-01-03      18
2022-01-04      30
2022-01-05      93
...            ...
2023-12-27      74
2023-12-28       6
2023-12-29      66
2023-12-30      54
2023-12-31      78

[730 rows x 1 columns]

In [148]:
df.loc["2022"]

            values
date
2022-01-01      98
2022-01-02      98
2022-01-03      18
2022-01-04      30
2022-01-05      93
...            ...
2022-12-27       3
2022-12-28      39
2022-12-29      80
2022-12-30      88
2022-12-31      82

[365 rows x 1 columns]

In [151]:
df.loc["2022-02"]

            values
date
2022-02-01      79
2022-02-02       7
2022-02-03      39
2022-02-04      43
2022-02-05      96
2022-02-06      93
2022-02-07      72
2022-02-08      12
2022-02-09      62
2022-02-10      90
2022-02-11      18
2022-02-12      30
2022-02-13      52
2022-02-14      35
2022-02-15      53
2022-02-16      84
2022-02-17       3
2022-02-18      49
2022-02-19      94
2022-02-20      75
2022-02-21      94
2022-02-22      50
2022-02-23      93
2022-02-24      76
2022-02-25      88
2022-02-26       2
2022-02-27      32
2022-02-28      23

In [152]:
df.loc["2022-01-15"]

values    7
Name: 2022-01-15 00:00:00, dtype: int64

In [153]:
df.loc[:"2022-01-15"]

            values
date
2022-01-01      98
2022-01-02      98
2022-01-03      18
2022-01-04      30
2022-01-05      93
2022-01-06      44
2022-01-07      58
2022-01-08      42
2022-01-09       5
2022-01-10      53

In [159]:
df.loc["2023-10-20":"2023-10-30"]

            values
date
2023-10-20      17
2023-10-21      79
2023-10-22      40
2023-10-23      24
2023-10-24      84
2023-10-25      56
2023-10-26       6
2023-10-27      85
2023-10-28      98
2023-10-29     100
2023-10-30      82

In [160]:
df.loc["2023-10-20":"2023-10-30"].index

DatetimeIndex(['2023-10-20', '2023-10-21', '2023-10-22', '2023-10-23',
               '2023-10-24', '2023-10-25', '2023-10-26', '2023-10-27',
               '2023-10-28', '2023-10-29', '2023-10-30'],
              dtype='datetime64[ns]', name='date', freq=None)

In [163]:
df.loc["2023-10-20":"2023-10-30"].index.day_name()

Index(['Friday', 'Saturday', 'Sunday', 'Monday', 'Tuesday', 'Wednesday',
       'Thursday', 'Friday', 'Saturday', 'Sunday', 'Monday'],
      dtype='object', name='date')

# `searchsorted`

In [206]:
numbers = pd.Series([number**2 for number in range(20)])

numbers

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
11    121
12    144
13    169
14    196
15    225
16    256
17    289
18    324
19    361
dtype: int64

In [207]:
numbers.searchsorted(225)

15

In [220]:
from random import randint, choice
import string
    
size = 10_000_000

df = (
    pd.DataFrame({
        "number": [number ** 2 for number in range(size)],
        "value": [choice(string.ascii_letters) for _ in range(size)],
    })
    .sort_values("value")
    .reset_index(drop=True)
)

df

                 number value
0         7607551396041     A
1        95797955495449     A
2        48464654262336     A
3        44862882496576     A
4        41063925036996     A
...                 ...   ...
9999995  35478986867776     z
9999996  35478855826569     z
9999997  35478700960000     z
9999998  35479785033081     z
9999999  14977697230609     z

[10000000 rows x 2 columns]

In [221]:
df = df.sort_values("number")

df

                 number value
7737204               0     o
6321483               1     g
6923527               4     k
7885248               9     o
314968               16     B
...                 ...   ...
4353616  99999900000025     W
1715352  99999920000016     I
3405664  99999940000009     R
9385728  99999960000004     w
5679147  99999980000001     d

[10000000 rows x 2 columns]

In [240]:
index = df["number"].searchsorted(99999900000025)

index

CPU times: user 310 µs, sys: 17 µs, total: 327 µs
Wall time: 325 µs

9999995

In [231]:
df.iloc[index]

number    99999900000025
value                  W
Name: 4353616, dtype: object

In [241]:
current_index = 0
index = -1

for number in df["number"]:
    if number == 99999900000025:
        index = current_index
        
    current_index += 1

In [242]:
index

9999995

# `itertuples`

In [4]:
data = [
    {"customer_id": 1, "name": "kim", "age": 35},
    {"customer_id": 2, "name": "lee", "age": 41},
    {"customer_id": 3, "name": "park", "age": 25},
]

df = pd.DataFrame(data)

df

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            3  park   25

In [5]:
for each in df.itertuples():
    print(each)

Pandas(Index=0, customer_id=1, name='kim', age=35)
Pandas(Index=1, customer_id=2, name='lee', age=41)
Pandas(Index=2, customer_id=3, name='park', age=25)

In [6]:
for each in df.itertuples():
    index, customer_id, name, age = each
    
    print(f"index: {index}")
    print(f"customer_id: {customer_id}")
    print(f"name: {name}")
    print(f"age: {age}")
    print("=======")

index: 0
customer_id: 1
name: kim
age: 35
=======
index: 1
customer_id: 2
name: lee
age: 41
=======
index: 2
customer_id: 3
name: park
age: 25
=======

In [7]:
for each in df.itertuples():
    print(each[2])

kim
lee
park

In [8]:
for each in df.itertuples(index=False):
    customer_id, name, age = each
    
    print(f"{name}'s age is {age}")

kim's age is 35
lee's age is 41
park's age is 25

In [9]:
for each in df.itertuples(index=False):
    print(each[1])

kim
lee
park

In [11]:
for each in df.itertuples():
    print(each.name)

kim
lee
park

# `groupby`

In [282]:
data = [
    {"customer_id": 1, "name": "kim", "age": 35},
    {"customer_id": 2, "name": "lee", "age": 41},
    {"customer_id": 3, "name": "park", "age": 25},
]

df = pd.DataFrame(data)

df

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            3  park   25

In [283]:
separated = lambda index: df.loc[index, "name"] == "kim"

df.groupby(separated).size()

False    2
True     1
dtype: int64

In [286]:
df["name"] == "kim"

0     True
1    False
2    False
Name: name, dtype: bool

In [287]:
df.groupby(df["name"] == "kim").size()

name
False    2
True     1
dtype: int64

In [322]:
data = [
    {'customer_id': 1, 'name': 'kim', 'age': 35},
    {'customer_id': 2, 'name': 'lee', 'age': 41},
    {'customer_id': 5, 'name': 'kim', 'age': 12},
    {'customer_id': 7, 'name': 'lee', 'age': 46},
    {'customer_id': 3, 'name': 'park', 'age': 25}
]

df_with_same_name = pd.DataFrame(data)

df_with_same_name

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            5   kim   12
3            7   lee   46
4            3  park   25

In [323]:
df_with_same_name["age"] < 30

0    False
1    False
2     True
3    False
4     True
Name: age, dtype: bool

In [324]:
df_with_same_name.groupby(df_with_same_name["age"] < 30).size()

age
False    3
True     2
dtype: int64

In [325]:
is_under_30 = df_with_same_name["age"] < 30

df_with_same_name.groupby([is_under_30, "name"]).size()

age    name
False  kim     1
       lee     2
True   kim     1
       park    1
dtype: int64

## `groupby.apply`

`groupby` 로 얻은 그룹을 인자로 전달받아 복잡한 연산을 수행할 수 있다

In [328]:
data = [
    {'customer_id': 1, 'name': 'kim', 'age': 35},
    {'customer_id': 2, 'name': 'lee', 'age': 41},
    {'customer_id': 5, 'name': 'kim', 'age': 12},
    {'customer_id': 7, 'name': 'lee', 'age': 46},
    {'customer_id': 3, 'name': 'park', 'age': 25}
]

df_with_same_name = pd.DataFrame(data)

df_with_same_name

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            5   kim   12
3            7   lee   46
4            3  park   25

`name` 별로 그룹화한 후 사용자 점의 함수를 적용한다

In [335]:
def print_group(group):
    print("=======")
    print(group)

df_with_same_name.groupby("name").apply(print_group)

=======
   customer_id name  age
0            1  kim   35
2            5  kim   12
=======
   customer_id name  age
1            2  lee   41
3            7  lee   46
=======
   customer_id  name  age
4            3  park   25

Empty DataFrame
Columns: []
Index: []

`name` 별로 나눈 각 그룹 중 가장 높은 나이와 가장 적은 나이의 차이를 구하세요

In [336]:
df_with_same_name.groupby("name").apply(lambda group: group["age"].max() - group["age"].min())

name
kim     23
lee      5
park     0
dtype: int64

# 연습문제

1. 아래 `numbers` `Series` 의 누적합을 구한 다음, 행의 값에 각각 2배를 곱한 `Series` 를 구하세요

In [307]:
# 세팅코드입니다
# 수정하지말고 한번 실행해주세요

from random import randint

numbers = pd.Series([number if number % 2 == 0 else number*3 for number in range(100)])

numbers

0       0
1       3
2       2
3       9
4       4
     ...
95    285
96     96
97    291
98     98
99    297
Length: 100, dtype: int64

In [312]:
# 아래에 정답코드를 작성해주세요

2. 아래 `datetime` 을 index 로 가지고있는 데이터프레임 `df` 에서 `.loc` 을 이용하여 "2022-06" 이상의 결과값만을 필터링하세요 (=> 2022-06-01 부터 2022-12-31 까지)

In [316]:
# 세팅코드입니다
# 수정하지말고 한번 실행해주세요

df = pd.DataFrame(
    data = {"value": [v / 2 for v in range(365)]},
    index = pd.date_range("2022-01-01", "2022-12-31")
)

df

            value
2022-01-01    0.0
2022-01-02    0.5
2022-01-03    1.0
2022-01-04    1.5
2022-01-05    2.0
...           ...
2022-12-27  180.0
2022-12-28  180.5
2022-12-29  181.0
2022-12-30  181.5
2022-12-31  182.0

[365 rows x 1 columns]

In [320]:
# 아래에 정답코드를 작성해주세요

3. 아래 `df` 의 월별 `value` 값의 평균(`mean`)을 구하세요

In [337]:
# 세팅코드입니다
# 수정하지말고 한번 실행해주세요

df = pd.DataFrame(
    data = {"value": [v / 2 for v in range(365)]},
    index = pd.date_range("2022-01-01", "2022-12-31")
)

df

            value
2022-01-01    0.0
2022-01-02    0.5
2022-01-03    1.0
2022-01-04    1.5
2022-01-05    2.0
...           ...
2022-12-27  180.0
2022-12-28  180.5
2022-12-29  181.0
2022-12-30  181.5
2022-12-31  182.0

[365 rows x 1 columns]

In [346]:
# 아래에 정답코드를 작성해주세요